<a href="https://colab.research.google.com/github/Jaethem8y/CS167/blob/main/Day03_exercises.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

An example of a markdown cell<br>
Author: <b>Your name here</b><br>
Date: February 4, 2020
# Python and Pandas Exercises

Before you begin, make sure you download the data from Blackboard and put it in your Google Drive where you know how to find it (preferably in a datasets folder).

In [1]:
#selecting columns in dataframes
import pandas
from google.colab import drive
drive.mount('/content/drive')

Mounted at /content/drive

In [6]:
#import the data:
#make sure the path on the line below corresponds to the path where you put your dataset.
titanic = pandas.read_csv("/content/drive/MyDrive/CS167/DataSets/titanic.csv")
titanic.head()

   survived  pclass     sex   age  ...  deck  embark_town  alive  alone
0         0       3    male  22.0  ...   NaN  Southampton     no  False
1         1       1  female  38.0  ...     C    Cherbourg    yes  False
2         1       3  female  26.0  ...   NaN  Southampton    yes   True
3         1       1  female  35.0  ...     C  Southampton    yes  False
4         0       3    male  35.0  ...   NaN  Southampton     no   True

[5 rows x 15 columns]

In [5]:
# what is the data type of titanic?
type(titanic)
#DataFrame

pandas.core.frame.DataFrame

In [7]:
# what are the features (column titles) of the titanic dataset?
titanic.columns

Index(['survived', 'pclass', 'sex', 'age', 'sibsp', 'parch', 'fare',
       'embarked', 'class', 'who', 'adult_male', 'deck', 'embark_town',
       'alive', 'alone'],
      dtype='object')

In [11]:
# display only the 'embark_town' column of the titanic data
titanic['embark_town']

0      Southampton
1        Cherbourg
2      Southampton
3      Southampton
4      Southampton
          ...
886    Southampton
887    Southampton
888    Southampton
889      Cherbourg
890     Queenstown
Name: embark_town, Length: 891, dtype: object

In [12]:
# what is the data type of the result of the previous cell? 
type(titanic['embark_town'])
#Series

pandas.core.series.Series

In [13]:
# what is the "shape" of the data frame?
titanic.shape
#(891,15)

(891, 15)

In [23]:
# make a subset (call the variable 'subset') of the data that consists of the last 20 rows of the data;
subset = titanic[-20:]
# verify that your subset has 20 rows
subset.shape
subset

     survived  pclass     sex   age  ...  deck  embark_town  alive  alone
871         1       1  female  47.0  ...     D  Southampton    yes  False
872         0       1    male  33.0  ...     B  Southampton     no   True
873         0       3    male  47.0  ...   NaN  Southampton     no   True
874         1       2  female  28.0  ...   NaN    Cherbourg    yes  False
875         1       3  female  15.0  ...   NaN    Cherbourg    yes   True
876         0       3    male  20.0  ...   NaN  Southampton     no   True
877         0       3    male  19.0  ...   NaN  Southampton     no   True
878         0       3    male   NaN  ...   NaN  Southampton     no   True
879         1       1  female  56.0  ...     C    Cherbourg    yes  False
880         1       2  female  25.0  ...   NaN  Southampton    yes  False
881         0       3    male  33.0  ...   NaN  Southampton     no   True
882         0       3  female  22.0  ...   NaN  Southampton     no   True
883         0       2    male  28.0  ...   NaN  Southampton     no   True
884         0       3    male  25.0  ...   NaN  Southampton     no   True
885         0       3  female  39.0  ...   NaN   Queenstown     no  False
886         0       2    male  27.0  ...   NaN  Southampton     no   True
887         1       1  female  19.0  ...     B  Southampton    yes   True
888         0       3  female   NaN  ...   NaN  Southampton     no  False
889         1       1    male  26.0  ...     C    Cherbourg    yes   True
890         0       3    male  32.0  ...   NaN   Queenstown     no   True

[20 rows x 15 columns]

In [25]:
# use loc to print out the data for passenger 890 on the titanic dataframe
titanic.loc[890]
# use iloc to print out the data for passenger 890 on the subest dataframe
subset.iloc[19]

survived                0
pclass                  3
sex                  male
age                    32
sibsp                   0
parch                   0
fare                 7.75
embarked                Q
class               Third
who                   man
adult_male           True
deck                  NaN
embark_town    Queenstown
alive                  no
alone                True
Name: 890, dtype: object

In [ ]:
# use a markdown cell; describe the difference between loc and iloc

# Difference
- loc uses name iloc uses index

In [27]:
# create a subset of the data (call the variable 'queenstown_subset') that consists only of passengers with
# a 'embark_town' that is "Queenstown"
queenstown_subset =  titanic[titanic['embark_town'] == 'Queenstown']
queenstown_subset
# hint: if you get a warning, you may need to explicitly note that you are making a copy of the original data by using 
# the .copy() function

     survived  pclass     sex   age  ...  deck  embark_town  alive  alone
5           0       3    male   NaN  ...   NaN   Queenstown     no   True
16          0       3    male   2.0  ...   NaN   Queenstown     no  False
22          1       3  female  15.0  ...   NaN   Queenstown    yes   True
28          1       3  female   NaN  ...   NaN   Queenstown    yes   True
32          1       3  female   NaN  ...   NaN   Queenstown    yes   True
..        ...     ...     ...   ...  ...   ...          ...    ...    ...
790         0       3    male   NaN  ...   NaN   Queenstown     no   True
825         0       3    male   NaN  ...   NaN   Queenstown     no   True
828         1       3    male   NaN  ...   NaN   Queenstown    yes   True
885         0       3  female  39.0  ...   NaN   Queenstown     no  False
890         0       3    male  32.0  ...   NaN   Queenstown     no   True

[77 rows x 15 columns]

In [28]:
# how many passengers are in queenstown_subset?
queenstown_subset.shape[0]

77

In [30]:
# what is the average fare for all of those in the queenstown_subset?
queenstown_subset['fare'].mean()

13.276029870129872

In [32]:
# what is the average age for all of those in the queenstown_subset?
queenstown_subset.age.mean()
# do all of the passengers have an age recorded? What is recorded if there is no age?
#NaN

28.089285714285715

In [ ]:
# What does unique(), mean(), isnull(), and fillna() do? Use a markdown cell to write your answers
# Use the Pandas documentation (https://pandas.pydata.org/pandas-docs/stable/reference/index.html)

#Unique - returns unique values from the column
#mean - returns average value
#isnull - show if data is missing
#fillna - fill the nan or other values

#Unique

In [40]:
# give examples of your use of unique(), mean(), median(), isnull()
queenstown_subset['age'].unique()
queenstown_subset['age'].mean()
queenstown_subset['age'].median()
queenstown_subset['age'].isnull()

5       True
16     False
22     False
28      True
32      True
       ...
790     True
825     True
828     True
885    False
890    False
Name: age, Length: 77, dtype: bool

In [45]:
# in the queenstown_subet dataframe
# for each row that does not have an age recorded, replace the NaN value with the calculated average
queenstown_subset['age'].fillna(queenstown_subset['age'].mean())
# hint: don't use a loop; it can be done in 1 line of code using fillna()
queenstown_subset

     survived  pclass     sex   age  ...  deck  embark_town  alive  alone
5           0       3    male   NaN  ...   NaN   Queenstown     no   True
16          0       3    male   2.0  ...   NaN   Queenstown     no  False
22          1       3  female  15.0  ...   NaN   Queenstown    yes   True
28          1       3  female   NaN  ...   NaN   Queenstown    yes   True
32          1       3  female   NaN  ...   NaN   Queenstown    yes   True
..        ...     ...     ...   ...  ...   ...          ...    ...    ...
790         0       3    male   NaN  ...   NaN   Queenstown     no   True
825         0       3    male   NaN  ...   NaN   Queenstown     no   True
828         1       3    male   NaN  ...   NaN   Queenstown    yes   True
885         0       3  female  39.0  ...   NaN   Queenstown     no  False
890         0       3    male  32.0  ...   NaN   Queenstown     no   True

[77 rows x 15 columns]

In [59]:
# load in the iris data
iris = pandas.read_csv("/content/drive/MyDrive/CS167/DataSets/irisData.csv")

# what is the median sepal width of just the Setosas?
iris[iris['species'] == 'Iris-setosa']['sepal width'].median()

3.4

In [63]:
# for those iris that are classified as versicolor and have 
# a petal-length > 4, what is the average sepal width?
iris[(iris['species'] == 'Iris-versicolor') & (iris['petal length'] > 4)]['sepal width'].mean()

2.902941176470588